src/cf/InformationRegisters/вогНастройкиОтображенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНастройкиОтображенияКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкиМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользоватьОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименоваине</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВидНастройкиМакетаСправочника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогНастройкиОтображенияКлассификаторов/Forms/ФормаСписка/Ext/Form/Module.bsl
// + Тищенко В.В.

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Импорт(Команда)
	
	ДиалогВыборФайла 		= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ОпопвещениеВыборФайла 	= Новый ОписаниеОповещения("ВыбранФайл",ЭтотОбъект);
	Фильтр = НСтр("ru = 'Файл выгрузки (*.xml)|*.xml'");
	ДиалогВыборФайла.Фильтр = Фильтр;
	ДиалогВыборФайла.Показать(ОпопвещениеВыборФайла);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка выполнена");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортМакета(Команда)
	
	ДиалогВыбораКаталога 		= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ОпопвещениеВыборКаталога 	= Новый ОписаниеОповещения("ВыбранКаталог",ЭтотОбъект);
	ДиалогВыбораКаталога.Показать(ОпопвещениеВыборКаталога);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка выполнена");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранФайл(Файлы,ДополнительныеПарамтеры) Экспорт
	
	Если Файлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Файлы.Количество() <> 0 Тогда
		ФайлЗагрузки 	= Файлы[0];
		АдресФайла 		= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлЗагрузки));
		ИмпортСервер(АдресФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИмпортСервер(АдресФайла)

	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		
		ИмяВременногоФайла 	= ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные 		= ПолучитьИзВременногоХранилища(АдресФайла);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ЧтениеXML.Прочитать();
		ЧтениеXML.Прочитать();
		
		Пока Сериализатор.ВозможностьЧтенияXML(ЧтениеXML) Цикл
			ПрочитанныйОбъект = Сериализатор.ПрочитатьXML(ЧтениеXML);
			ПрочитанныйОбъект.ОбменДанными.Загрузка = Истина;
			ПрочитанныйОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранКаталог(Каталог,ДополнительныеПараметры) Экспорт
	
	Если Каталог = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Каталог.Количество() <> 0 Тогда
		КаталогЗаписи 	= Каталог[0];
		ФайлМакета		= ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогЗаписи) + "export_layout.xml";
		МассивСтрок 	= Элементы.Список.ВыделенныеСтроки;
		АдресФайла 		= ЭкспортМакетаСервер(МассивСтрок);
		Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ФайлЗаписи = ПолучитьИзВременногоХранилища(АдресФайла);
		ФайлЗаписи.Записать(ФайлМакета);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЭкспортМакетаСервер(МассивСтрок)
	
	Если МассивСтрок.Количество() <> 0 Тогда
		
		ИмяВременногоФайла 	= ПолучитьИмяВременногоФайла("xml");
		ЗаписьXML 			= Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Начало");
		
		Для каждого Стр Из МассивСтрок Цикл
			
			ТекущийОбъект = РегистрыСведений.вогНастройкиОтображенияКлассификаторов.СоздатьНаборЗаписей();
			ТекущийОбъект.Отбор.Объект.Установить(Стр.Объект);
			ТекущийОбъект.Отбор.Включен.Установить(Стр.Включен);
			ТекущийОбъект.Отбор.ИспользоватьОтбор.Установить(Стр.ИспользоватьОтбор);
			ТекущийОбъект.Отбор.Наименоваине.Установить(Стр.Наименоваине);
			ТекущийОбъект.Прочитать();
			
			Сериализатор.ЗаписатьXML(ЗаписьXML,ТекущийОбъект);
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();
		
		Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// - Тищенко В.В.
